app/controllers/songs_controller.rb

  def index
    if params[:artist_id]
       @artist = Artist.find_by(id: params[:artist_id])
       if @artist
          @songs = @artist.songs
       elsif @artist.nil?
          flash[:alert] = "Artist not found."
          redirect_to artists_path
       end
    else
      @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 2]]

  def show
    if params[:artist_id] && Artist.find_by(id: params[:artist_id])
      @artist = Artist.find_by(id: params[:artist_id])
      if @artist.songs.find { |song| song.id == params[:id].to_i }
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT ?  [["artist_id", 1], ["id", 1], ["LIMIT", 1]]